Revit 2027 API
ParameterTypeId.RebarShapeCrankStartLength Property
 "Start Crank Length"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarShapeCrankStartLength { get; }
Public Shared ReadOnly Property RebarShapeCrankStartLength As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarShapeCrankStartLength {
	ForgeTypeId^ get ();
}
static member RebarShapeCrankStartLength : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace